[{
    "id": "Palw",
    "bg": "palw-bg.jpg",
    "thumbnail": "palw-th.jpg",
    "title": "Palworld",
    "alt_title": "Of all the monster taming games out there, this is the best one AND IT'S NOT EVEN CLOSE",
    "review_markdown": "# **Palworld Review — Chaos, Charm, and Clubbing Cute Creatures**\n\n<div class=\"video-embed-container\"><iframe src=\"https://www.youtube.com/embed/IltMIJeK-1M?si=XROb_k4ZgBFlr6K5\" title=\"Palworld | Early Access Launch Trailer | Pocketpair\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><p class=\"video-caption\">Watch this chaotic Palworld Early Access Trailer</p></div> \n\n## **Introduction**\n\nPalworld is an open world, survival and creature collector game, where you make bonds with majestic creatures by hitting them with a club and asking for their compliance — if they don't, then they go through eternal slavery. It's like Ark meets Pokémon, or any other survival/crafting meets Pokémon mashup; doesn’t matter how many comparisons you wanna make, this game has what it takes to stand on its own. As a huge Pokémon fan myself I was skeptical, but this blew my mind. That's why I’ve logged more than 160 hours in this game. There's also the controversy around it regarding the use of AI and copying Pokémon designs. In this review I'll talk about all such topics, more about hilarious occurrences, its mechanics, creatures, overall gameplay, and my opinions on the controversies surrounding it.\n\n---\n\n## **Gameplay — the Basics**\n\nPalworld has very simple gameplay, and it works very well for it. You wake up washed up on a beach, start collecting resources like wood, stone, food, and shelter — all the basic essentials. As an open world game, you come across many creatures called Pals. Some are adorable, some ferocious, and some among them are legendaries.\n\n---\n\n## **Types & Utility**\n\nThese Pals have different types: Normal, Fire, Water, Grass, Ground, Dark, and Dragon. They have traits tied to those types — for example, Fire-type Pals can help you cook or smelt metal; Grass-type Pals help with planting. You can make the rest of the connections yourself; they’re obvious enough. This is such a simple thing, but it’s wild Pokémon hasn’t implemented these mechanics like this already, especially where Pals actually *do* the work for you. (I got distracted there ranting about Pokémon — let’s get back on topic.)\n\n---\n\n## **Catching Pals**\n\nYou can catch these Pals by crafting Pal Spheres or sometimes finding them on the ground all around the world. Also, there are enemy campsites all over the map; you can also save those Pals by capturing them. It's so funny that you don't release those Pals into the wild — one kidnapper to another.\n\n---\n\n## **Survival Loop & Automation**\n\nBut just because you see these creatures in posters and banners, don't think that's the only thing to care about — this is survival through and through. I dare say it's a survival game *with* Pals. It has crafting and base-building systems, a proper tech tree, and you unlock more things by increasing your player level. There’s furniture, armor, weapons, materials — all the usual base stuff.\n\nPlace a Palbox and that area becomes your base. Build structures that give you different products — for example, a crafting table to make ammo or arrows. But you don't want to do all this labour yourself; that's where Pals come in. This is where Palworld really shows its colours.\n\nA lot of people hate survival-crafting games because of intense grinding. If you like grinding, fine — but a lot of folks don’t. Palworld solves this by letting adorable Pals do the grind. They'll work for you even when you’re off exploring. Need arrows but don’t want to stand at the crafting table? Assign a Pal like Anubis and go exploring. That loop — gain levels, unlock structures, find Pals to run those structures — is the core gameplay. Can’t find a suitable Pal? Go exploring and find one. One base not enough? Find another area and expand. That’s the game loop.\n\n---\n\n## **Example Pal: Cattiva**\n\nFor example, a Cattiva is found near the spawn area — a bipedal light-pink cat, great for beginners. This Pal has handiwork, mining, and transportation traits: it can help mine rocks, assist crafting, and move things around the base. Useful, obvious, and delightful.\n\n---\n\n## **Combat**\n\nLet’s talk about its combat system, because MAN am I a fan of it. You can carry a maximum of five Pals outside your base; these Pals help you in battle, chores, and traveling. Each Pal has three designated attacks with cooldowns. Pals learn new moves as they level up. Also, a Pal’s level can’t exceed the player’s — if a Pal’s level is higher, it syncs down to match you.\n\nIf you have a rideable Pal, you can mount it in battle and control it — including its attacks. It feels so satisfying when you’re riding a Pal and you spot a low-level Pal running in a field: you just obliterate them out of nowhere. Sometimes they’re asleep at night; you attack and they die without even knowing what killed them — it’s always such a thrill.\n\nWhile riding, you can still attack or throw Pal Spheres to capture Pals on the move. If you prefer to fight yourself, you can: jump, run, dodge, and use weapons. It’s always funny to see whether a Pal's elemental attack or a Desert Eagle wins. In combat you also carry up to four weapons — rifles, ARs, SMGs, shotguns — Palworld has you covered.\n\nI always wondered how it would feel to have these creatures in real life; Palworld shows that weird reality very well. Instead of hunting a deer, you hunt a purple deer. You have armor, an auto-shield that recharges, helmets that reduce headshot damage, and accessories with perks (like glasses that show wild Pal HP and stats to help you choose the best catch). All combined create a combat system that’s fun, satisfying, and addicting.\n\n---\n\n## **World**\n\nPalworld’s map is HUGE, and Pocketpair keeps expanding it. Unlike many open worlds that feel empty, Palworld stays engaging and vibrant. Biomes include grasslands, mountains, volcanic zones, snowy regions, and dense forests with edible berries.\n\nUpdates like Sakurajima added a Japanese-themed island full of cherry blossoms and new Pals. Feybreak added an even larger island with bizarre, color-shifted forests — red, purple, yellow — that look unique in a way my words barely describe. On Feybreak, you can’t fly on your flying Pals until you destroy missile launchers scattered across the island — otherwise they’ll shoot a missile that WILL kill your Pal. That’s a creative gameplay twist I loved.\n\nThe world also has Alpha Pals (bosses), underground caves that open for limited windows and contain rare resources, and enemy fortresses. All these things — biomes, bosses, caves — make exploration interesting.\n\n---\n\n## **Bugs & Rough Edges**\n\nIt’s not all perfect. Some areas feel vacant. There are bugs: players, Pals, or enemies sometimes get stuck in rock walls; it’s especially annoying when a boss or legendary gets wedged in a ceiling while you’re trying to capture it. After big updates FPS drops and lag spikes happen, though Pocketpair generally patches these quickly. Constructive criticism: fix the collision and performance issues and this world will feel even smoother.\n\n---\n\n## **Pals and the Controversy**\n\nThere are 187 Pals total, 58 of which are variants (different color/type combos). For example, Whalaska is a blue water type; Whalaska Ignis is a red water/fire variant. Variants change moves and stats, so Pals feel distinct depending on biome and lineage.\n\n---\n\n## **AI Rumors**\n\nDid they use AI to generate Pal designs? I don’t think so. The person who spread that rumor on X/Twitter later admitted it was intentional and provided no proof [ALLEGEDLY]. The rumor gained traction because Pocketpair’s CEO said some positive things about AI on social media — but Steam requires disclosure of AI-generated content, and Palworld lists none. Also, the earliest Palworld trailer I found is from July 5, 2021 — image-gen AIs back then were pretty poor. People jumped to conclusions out of skepticism or to find an outlet for anger. A loud minority made it blow up, but that doesn’t mean the accusation is true.\n\n---\n\n## **Pokémon Comparisons — Yes, Some Designs Are Close**\n\nDid Pocketpair copy Pokémon? I think they absolutely borrowed — and that doesn’t bother me. Saying they didn’t take inspiration would be delusional. Compare Gyarados and Jormuntide, Decidueye and Robinquill, or Lucario and Anubis — they might as well be brothers. There are some absurd comparisons too (Wooloo vs Lamball — both are white sheep), but animals exist in real life; Pokémon often draws from those same animals. With over a thousand Pokémon, overlap is inevitable.\n\nSo no, I don’t hate Palworld for similarities. Should you hate it? Your call. Don’t be a fanboy for any company — you’re just a statistic to them.\n\n---\n\n## **Personal Experience — Why I Stayed (160+ Hours)**\n\nI had a blast. Saying I “enjoyed it” is an understatement. I love the mechanics, the combat, the Pals, their unique animations — the interaction between player and Pal feels like what I imagined Pokémon trainer interaction could’ve been.\n\nThe first big boss I fought was a Chillet. I saw it and thought, “I need this Pal, at all costs.” At the time I had Hoocrates, Daedream, and a Cattiva (level ~8–9), while Chillet was level 11. I went in with an axe and pickaxe like an idiot and died before my Pals. I didn’t even know how to dodge — the game doesn’t have a movement tutorial, so how would I? It feels stupid now (because I am stupid), but it made the moment memorable.\n\n---\n\n## **Favorite Pals**\n\n1. **Splatterina** — my number one. Her design, moves, and sneaky laugh when she notices you in the wild are iconic.![Palworld Pal-Splatterina](Images/Pal-Splatterina.png \"Splatterina stats and status\")\n2. **Shadowbeak** — great design and strong kit.![Palworld Pal-Shadowbeak](Images/Pal-Shadowbeak.png \" My Shadowbeak's stats and status\")\n3. **Bastigor** — just cool, plain and simple.![Palworld Pal-Bastigor](Images/Pal-Bastigor.png \" My Bastigor's stats and status\")\n\nSplatterina is my favourite Pal in Palworld. Her design, her moves, her laugh — everything is just so cool. I found her a bit before mid game. I was just exploring the world on my Nitewing (slow af mount, I know), and I reached Feybreak Island. There, all the Pals were above level 48; me being level 25–30, I would just wander around the island and came across a dark egg, which I kept in my inventory and ran towards the teleport statue. For some reason there's a huge scarcity of teleport statues on the whole island. I had a really tough time finding one, but eventually I did and teleported. This was such an adrenaline rush, because had I died, I would have lost everything in my inventory — the egg along with it. Later, when hatching that egg, a Splatterina came out of it. I thought it was the coolest Pal ever.\n\nFor Shadowbeak and Bastigor the story isn't too exciting, I bred them purposefully because there designs were cool.\n\n---\n\n## **Conclusion — Play It Before You Decide**\n\nIt’s a really fun game. If you’re a Pokémon fan, a survival-crafting fan, or someone who likes actually *playing* games — give Palworld a try before making a decision based on ethics or controversy. It’s a game; if you like it, play it. If not, don’t.\n\nPocketpair might have shady practices, and that’s worth watching, but a good game is a good game — and MAN do they know how to make a fun one. It’s action-packed, chaotic, and endlessly entertaining. I’d recommend it to everyone.\n",
    "genre": [
      "Open World",
      "Survival",
      "Creature Collector",
      "Crafting"
    ],
    "credits": "Palworld (2024) — © Pocketpair, Inc.",
    "year": 2024,
    "released": "2024-01-19",
    "tags": [
      "creature-collector",
      "survival",
      "crafting",
      "multiplayer"
    ],
    "reviewed": false,
    "personal_rating": null,
    "review_date": null,
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  },
  {
    "id": "GR2",
    "bg": "ghost2c.jpg",
    "thumbnail": "ghost2.jpg",
    "title": "Ghostrunner 2",
    "alt_title": "Amazing game, just like it's prequel, did justice to the franchise. I do have some nitpicking. ",
    "review_markdown": "## Introduction \n\n Ghostrunner 2 is a game I really liked, just like its prequel Ghostrunner. It’s fast, unforgiving, and gives you the experience of what it feels like to be a **Cybernetic Ninja**. In this review, I’ll talk about Ghostrunner 2—its features, mechanics, world, story, and all that stuff. I also think it’s an improvement over the first game, though with certain downsides as well.<div class=\"video-embed-container\"><iframe src=\"https://www.youtube.com/embed/ahtQsw53Ets?si=xE6kHZSre79UhnLu\" title=\"Ghostrunner Official Gameplay Trailer\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><p class=\"video-caption\">Get a glimpse of the frantic action in this gameplay trailer!</p></div>\n\n## Gameplay\n\nJust like the first game, you’ve got one life—and so do the enemies. Either they kill you in one shot, or you kill them in one shot. It has an extremely fast respawn time, so you don’t feel discouraged while dying and can jump right back into the fight. You learn by dying in this game—it’s totally normal to die 30 to 35 times. No need to feel frustrated. Sure, there’s a learning curve, but it’s no steeper than in any RPG out there. Death is a lesson—just learn from it.\n\nThe combat system is the meat and potatoes of the game. This is where I think Ghostrunner 2 felt a bit lacking compared to the first game due to its overall enemy design (not counting bosses, read Personal Experience section for more clarity on that.). Just like before, you start the game with a katana, a grappling hook, and a time-slowing power. You can attack, block, and parry with perfect timing. The tutorial introduces these mechanics right away—awesome stuff.\n\nJust like in the previous game, there are skills in this one as well. The game introduces new skills as you progress, each offering advantages in specific levels.\n\n### Skills\n1. **Shuriken:** Throw shuriken at enemies or puzzle buttons. You can also throw them at special walls to create grapple points. A great addition to the movement system.\n2. **Shadow:** Become invisible and leave a decoy. The effect breaks if an enemy spots or hits you. Simple but effective.\n3. **Tempest:** A powerful shockwave from your palm that destroys enemies and deflects projectiles. It can also push crates to reveal hidden areas or grapple points. I love this ability—it was my favorite from the first game—but using it for puzzles felt unnecessary and less satisfying.\n\n### Ultimate Abilities\n1. **Blink:** Extremely fast dash toward enemies (feels like teleportation). Can kill multiple enemies if they’re lined up. Classic Ghostrunner 1 ability—always fun.\n2. **Overlord:** Hack enemies’ minds to make them fight each other. Adds strategic depth. Higher levels allow explosive AOE kills or multiple hacks.\n3. **Motoric Overload:** Boosts speed, jump, and overall movement while maintaining time-slowing power. Perfect for crowd control and boss fights—feels badass.\n4. **Flux:** A red laser beam from your palm to take out tricky enemies from range. Scales well with upgrades and works at all stages of the game.\n5. **Sensory Overdrive:** Pauses time, freezing enemies while you can move and kill freely. Extremely powerful. Higher levels extend the duration and allow grappling onto enemies.\n\n### Motorcycle & Traversal![Ghostrunner 2 Motorcycle screenshot](Images/GR2MotorCycle.png \"Ghostrunner 2 Motorcycle screenshot\")\nThe new **two-wheeled motorcycle** is easily one of the best additions to the game. It’s stylish, fast, and dynamic. It has guns, can knock enemies away, and allows wild parkour moments—like jumping off a broken bridge, grappling back onto it mid-air, and continuing at 200 km/h. You can even ride on walls and ceilings with enough momentum. There’s a full boss fight designed for the motorcycle too—easily one of the best moments in the game.\n\nThere’s also a new **gliding mechanic**, which lets you traverse massive areas quickly. Together, these systems make the gameplay feel fresh and open.\n\nOf course, the **music** in Ghostrunner 2 is half the hype. Shoutout to **Daniel Deluxe**, **We Are Magonia**, and all the musicians behind both games—they absolutely killed it. No matter where you are in the game, the soundtrack perfectly fits the tone, from ambient build-ups to adrenaline-pumping boss fights.\n\n## Story & World\n\n![Ghostrunner 2 Cybervoid](Images/GR2Void.png \"Ghostrunner 2 Cybervoid.\")Ghostrunner 2 picks up right after the first game, with some time passed since. Like before, the game wastes no time—you start killing enemies immediately (I like that).\n\nThis time, though, the scope has expanded. In Ghostrunner 1, the story revolved entirely inside the Tower as you climbed it. In Ghostrunner 2, we finally step outside. I love this change—it adds variety to the story, level design, and environment. There’s only so much you can do inside a closed city. Now we see the world beyond—a barren wasteland with no organic life. Broken buildings, rusted vehicles, shattered bridges—it all tells the story of a fallen civilization before the apocalypse. It’s atmospheric, desolate, and beautiful in its own way.\n\n## Personal Experience\n\nNow, I think the mob designs were a bit bland this time. The starting baton enemies didn’t feel threatening—neither fast nor precise like ranged ones. Some areas also felt too large and open. As a cyber-ninja, the character can feel slow in these massive spaces. The first-person perspective works beautifully inside the Tower, but in open areas, it can feel slightly sluggish. That’s really my only nitpick.\n\nAside from that, I had a blast. The game took me about **12 hours** to finish, and I wish I could experience it again for the first time. I died about **350 times** in this game—down from 1,600 in the first one—and never once thought about quitting. Ghostrunner was my first ever PC game, and it has a special place in my heart. Ghostrunner 2 might have some rough spots, but never a dull moment. It’s not inferior to its predecessor—it’s just different, in a good way.\n\n## Conclusion\n\nGhostrunner 2 is action-packed, fast-paced, and brutally satisfying. It’ll make you rage, but never bore you. It mixes puzzles, high-speed combat, and tight platforming into one chaotic, rewarding package. The atmosphere, world design, and soundtrack all hit hard. If you’re into Cyberpunk-style settings, fast combat, and games that push your skill to the limit, this one’s absolutely worth your time.",
    "genre": [
      "Action",
      "Cyberpunk",
      "Fast-Paced"
    ],
    "credits": "Ghostrunner 2 (2023) — © One More Level / Published by 505 Games",
    "year": 2023,
    "released": "2023-10-26",
    "tags": [
      "parkour",
      "first-person",
      "fast-paced",
      "synthwave"
    ],
    "reviewed": false,
    "personal_rating": null,
    "review_date": null,
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  },
  {
    "id": "GR1",
    "bg": "GR1-bg.jpg",
    "thumbnail": "GR1-th.jpg",
    "title": "Ghostrunner",
    "alt_title": "Criminally Underated game people forget about.",
    "review_markdown": "## Introduction\n\nGhostrunner is a game unlike anything I've ever played before. Brash, stylish, unforgivingly brutal, and yet it feels rewarding and satisfying, it throws cyberpunk atmospherics and ninja-like parkour into die-from-one-hit combat. In the following review, I'll be discussing the story, the game itself, and the overall experience—the elements that make it great, where it falls short, and why I couldn't put it down even after I'd finished it.\n\n<div class=\"video-embed-container\"><iframe src=\"https://www.youtube.com/embed/TtGjfirmjq0\" title=\"Ghostrunner Official Launch Trailer\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><p class=\"video-caption\">Get a glimpse of the frantic action in this gameplay trailer!</p></div>\n\n## Gameplay\nAt its core, Ghostrunner is a first-person action-platformer that runs and prides itself on speed and precision. You and the enemies die in a hit each time (except bosses), making each confrontation a test of reflexes, timing, and pattern learning.\n\nOne mistake means instant death. And you WILL die a lot. In my first playthrough, I died over 1,600 times. But that’s the beauty of the game: death isn't frustrating, you just learn what you did wrong, then improve upon it. Thankfully there's an incredibly fast respawn system. Each restart teaches you the level’s layout, enemy placement, and the limits of your own movement, until you start developing muscle memory and flowing through levels like an actual cyber-ninja.\n\nThese are the abilities the game provides you with as you progress:\n\n<ul><li>Time-Slowing Power – Your most valuable ability that lets you slow down time and move around in air, then avoid bullets, energy waves or just physical confrontation.</li></ul>\n\nOffensive abilities:\n\n<ul><li>Blink – A line-targeting slash that cuts through enemies in a line and gets you up close fast, you can target multiple enemies at once. Incredibly fast and fun ability.</li>\n<li>Tempest – A very powerful shockwave that obliterates groups and actually deflects projectiles. Seemingly the strongest power of all as it has really wide hit box you don't even have to aim something as long it is somewhat closer to the centre of your screen .</li>\n<li>Surge – A ranged energy katana slash. Very useful in hitting far away enemies, but though it feels a bit underpowered compared to other abilities as you actually have to aim with it for it to work, that's I would just go a bit closer and then use Tempest.</li> \n<li>Overlord – A mind-hack that causes enemies to turn against one another and adds strategy in battles, depending on who you control it can really elevate your gameplay.</li></ul>\n\nThere is also a grappling hook, slide, and wall-run that is silky smooth and adds depth to the overall parkour system. Movement is arguably more important than combat, possibly more often. Honestly, this is more of a parkour game than a fighting game, you die more from messing up a jump than from getting shot (slight exaggeration). But when you string a perfect wall-run into a perfect slide into a perfect grapple into a perfect kill, the whole run is so satisfying, it is amazing.\n\nThe momentum mechanic adds even more depth, letting you skip sections or fly through levels faster than intended. Speedrunners exploit this constantly, and even in casual play, it makes movement addictive.\n\nLastly, to upgrade your abilities you get a Tetris-like grid system, with different chips as upgrades for different abilities. Experiment and tweak around with the build you want.\n\nThere is also a grappling hook, slide, and wall-run that is silky smooth and adds depth to the overall parkour system. Movement is arguably more important than combat, possibly more often. Honestly, this is more of a parkour game than a fighting game, you die more from messing up a jump than from getting shot (slight exaggeration). But when you string a perfect wall-run into a perfect slide into a perfect grapple into a perfect kill, the whole run is so satisfying, it is amazing.\n\nThe momentum mechanic adds even more depth, letting you skip sections or fly through levels faster than intended. Speedrunners exploit this constantly, and even in casual play, it makes movement addictive.\n\nLastly, to upgrade your abilities you get a Tetris-like grid system, with different chips as upgrades for different abilities. Experiment and tweak around with the build you want.\n\n![Ghostrunner In-Game Screenshot](ImagesN/GR1-bg.png \"Player roaming in Ghostrunner city level.\")\n\n## Story & World\nThe game itself is pretty simple but is enough to sustain the experience. You are a cybernetic AI ninja climbing through a cyberpunk dystopian tower in order to dethrone a dictator. It is not the most original but is perfect for the game itself, simple, quick, and concise.\n\nThe game is at its strongest in the presentation department, though. From neon-streaked skyscrapers to ominous industrial halls, the world is drenched with atmosphere. Throw in the POV combat perspective of ducking bullets at the very last second and slicing up enemies and then the death blow slow motion and you actually do feel that you're a futuristic ninja.\n\nAnd the music. Each level has a driving synthwave song/music that raises the hype, it triggers with different moments in-game like combat or parkouring. Even after 58+ hours of playtime, I never grew bored with the soundtrack—the tunes suit the hyper-aggressive action to a tee.\n\n## Personal Experience\nGhostrunner was my first real PC game. I didn't do anything more substantial prior to that at a friend's computer in the past. But considering it was my first PC game ever, maybe that wasn't that great of a choice. I used to have trouble slowing time, then moving out of the bullet's way, then going for the kill. But I'm much better at it now, and it helped me quite a bit in other games as well.\n\nI recall playing for 14 hours and 12 minutes in my first playthrough and I cannot forget it because the game had me so engrossed because of (or perhaps in spite of) the sheer violence of it all. And I've spent 58+ hours playing the first game itself and playing through levels just for the challenge of it all. I went ahead and played the sequel game, Ghostrunner 2, and I've completed that game as well.\n\nAt one time I even attempted speedrunning practice for 30 hours straight. I never quite became a true speedrunner but it did reveal to me the sheer depth that the movement system has.\n\n## Strengths & Weaknesses\n### Strengths\n- Addictive skill-acquiring play loop (die → learn → die → kill).\n- Seamless combat that makes you feel like a ninja.\n- Parkour/movement system that feels smooth but incredibly fast.\n- Amazing synthwave soundtrack.\n- High replay value, you can try other game modes, incredibly fun as well.\n\n### Weaknesses\n- Extremely punishing difficulty—not for everyone. A lot of folks do quit the game because of the 1 HP of the player.\n- Lack of enemy variety, at a certain point the enemies do start to feel a bit repetitive.\n- Excessive emphasis on parkour may disappoint players who want straight-up combat.\n- Story is okay at best but nothing new, kinda cliché.\n\n## Conclusion\n\nGhostrunner is one of the few titles that will make you work for each win. It is unforgiving, it does not coddle you, and it will whip you to death repeatedly. But in exchange, it rewards you with some of the most fun gaming experiences that I've ever had. Its story is paper-thin, most people wouldn't care too much for it if not for the theme and really nice atmosphere. The learning curve is brutal—but the atmosphere, mechanics, and sheer adrenaline it gives make it a great title. I found it the perfect first PC game: a trial that challenged me to get better, and a world I loved getting myself involved in. If you're looking for something unique, stylish, and challenging, then Ghostrunner is completely worth your time.",
    "genre": ["Action","Cyberpunk","Fast-Paced"],
    "credits": "Ghostrunner (2020) — © One More Level, 3D Realms, Slipgate Ironworks / Published by 505 Games",
    "year": 2020,
    "released": "2020-10-27",
    "tags": ["parkour","difficulty","synthwave","first-person","speedrunning"],
    "reviewed": true,
    "personal_rating": 4.7,
    "review_date": "2022-03-05",
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  },
  
  {
    "id": "VampS",
    "bg": "Vamp-bg.jpeg",
    "thumbnail": "Vamp-th.jpeg",
    "title": "Vampire Survivors",
    "alt_title": "A game that apreciates simplicity.",
    "review": "About to be Published",
    "genre": [
      "Rogue-like",
      "2D"
    ],
    "credits": "Vampire Survivors (2022) — © poncle",
    "year": 2022,
    "released": "2022-12-20",
    "tags": [
      "roguelike",
      "pixel-art",
      "auto-horde",
      "casual"
    ],
    "reviewed": false,
    "personal_rating": null,
    "review_date": null,
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  },
  {
    "id": "CONTROL",
    "bg": "CONTROL-bg.jpeg",
    "thumbnail": "CONTROL-th.jpg",
    "title": "CONTROL",
    "alt_title": "An in depth game people didn't appreciate.",
    "review": "About to be Published",
    "genre": [
      "Action",
      "Supernatural"
    ],
    "credits": "Control (2019) — © Remedy Entertainment / Published by 505 Games",
    "year": 2019,
    "released": "2019-08-27",
    "tags": [
      "supernatural",
      "atmospheric",
      "narrative",
      "third-person"
    ],
    "reviewed": false,
    "personal_rating": null,
    "review_date": null,
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  },
  {
    "id": "Killk",
    "bg": "KILL.jpg",
    "thumbnail": "KILLP.jpeg",
    "title": "Kill Knight",
    "alt_title": "An in depth game people didn't appreciate.",
    "review": "About to be Published",
    "genre": [
      "Top-down Shooter",
      "Arcade"
    ],
    "credits": "Kill Knight (2024) — © PlaySide Studios",
    "year": 2024,
    "released": "2024-06-10",
    "tags": [
      "top-down",
      "arcade",
      "fast-paced",
      "retro"
    ],
    "reviewed": false,
    "personal_rating": null,
    "review_date": null,
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  },
  {
    "id": "deusx",
    "bg": "deus.jpg",
    "thumbnail": "deusx.jpg",
    "title": "Deus Ex: Mankind Divided",
    "alt_title": "A timeless classic, fans of sci-fi and badass combat will definetely like it.",
    "review": "About to be Published",
    "genre": [
      "Cyberpunk",
      "Stealth",
      "Sci-fi"
    ],
    "credits": "Deus Ex: Mankind Divided (2016) — © Eidos-Montréal / Published by Square Enix",
    "year": 2016,
    "released": "2016-08-23",
    "tags": [
      "stealth",
      "rpg",
      "sci-fi",
      "choices"
    ],
    "reviewed": false,
    "personal_rating": null,
    "review_date": null,
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  },
  
  {
    "id": "mortal",
    "bg": "mortal.jpg",
    "thumbnail": "mortalth.jpg",
    "title": "Mortal Shell",
    "alt_title": "A souls-like with ORIGINALTY!!! Waiting for it's sequel now!!!",
    "review": "About to be Published",
    "genre": [
      "Souls-like",
      "RPG",
      "Action"
    ],
    "credits": "Mortal Shell (2020) — © Cold Symmetry / Published by Playstack",
    "year": 2020,
    "released": "2020-08-18",
    "tags": [
      "soulslike",
      "challenging",
      "atmospheric"
    ],
    "reviewed": false,
    "personal_rating": null,
    "review_date": null,
    "ratings": {
      "story": 5.0,
      "gameplay": 10.0,
      "world": 10.0,
      "art": 5.0,
      "replayability": 5.0
    }
  }
  
]



